In [1]:
#Translating SQL Queries to Pandas Operations

In [2]:
import pandas as pd

In [21]:
df = pd.read_csv('https://raw.githubusercontent.com/Avee-81/SQL-to-Pandas/main/data.csv')

In [3]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.4.1-py3-none-any.whl (21 kB)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\skme2\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in c:\users\skme2\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\skme2\anaconda3\lib\site-packages (from ipython-sql) (1.3.13)
Requirement already satisfied: ipython>=1.0 in c:\users\skme2\anaconda3\lib\site-packages (from ipython-sql) (8.4.0)
Requirement already satisfied: six in c:\users\skme2\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Collecting prettytable<1
  Downloading prettytable-0.7.2.zip (28 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: backcall in c:\users\skme2\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: jedi>=0.16 in c:\users\skme2\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.2)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\skme2\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.30)
Requirement already satisfied: traitlets>=5 in c:\users\skme2\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: stack-data in c:\users\skme2\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\users\skme2\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.5)
Requirement already satisfied: pickleshare in c:\users\skme2\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in c:\users\skme2\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: matplotlib-inline in c:\users\skme2\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\skme2\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (61.2.0)
Requirement already satisfied: pygments>=2.4.0 in c:\users\skme2\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\skme2\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\skme2\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: asttokens in c:\users\skme2\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\skme2\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)
Requirement already satisfied: executing in c:\users\skme2\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.8.3)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py): started
  Building wheel for prettytable (setup.py): finished with status 'done'
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13714 sha256=6c39b12e09c523ee265e665b89c79256dc421204faa232ae918938e79d8ae7cd
  Stored in directory: c:\users\skme2\appdata\local\pip\cache\wheels\48\6d\77\9517cb933af254f51a446f1a5ec9c2be3e45f17384940bce68
Successfully built prettytable
Installing collected packages: prettytable, ipython-sql
Successfully installed ipython-sql-0.4.1 prettytable-0.7.2

In [4]:
%load_ext sql

In [5]:
%sql sqlite://

In [6]:
import numpy as np

In [22]:
df

   ID first_name last_name gender  salary  level date_of_joining
0   1      Peter   Sanders      M   10000      2        10/03/20
1   2      Julie    Miller      F   12000      2        14/01/20
2   3     Rachel      Bray      F    9000      1        09/03/20
3   4      Priti   Agarwal      F   10000      2        01/03/20
4   5      David       Cox      M    5000      1        28/05/20
5   6      Helly     Raval      F    8000      1        19/06/20
6   7       John     Frank      M   13000      3        12/11/19
7   8       Mark  Franklin      M   13500      3        12/11/19
8   9   Cristina       Rel      F   15000      4        22/09/19
9  10      Brock    Murray      M   11000      2        13/02/20

In [23]:
df.info

<bound method DataFrame.info of    ID first_name last_name gender  salary  level date_of_joining
0   1      Peter   Sanders      M   10000      2        10/03/20
1   2      Julie    Miller      F   12000      2        14/01/20
2   3     Rachel      Bray      F    9000      1        09/03/20
3   4      Priti   Agarwal      F   10000      2        01/03/20
4   5      David       Cox      M    5000      1        28/05/20
5   6      Helly     Raval      F    8000      1        19/06/20
6   7       John     Frank      M   13000      3        12/11/19
7   8       Mark  Franklin      M   13500      3        12/11/19
8   9   Cristina       Rel      F   15000      4        22/09/19
9  10      Brock    Murray      M   11000      2        13/02/20>

In [24]:
df.date_of_joining.dtype

dtype('O')

In [25]:
df["date_of_joining"] = pd.to_datetime(df.date_of_joining)

In [26]:
df.date_of_joining.dtype

dtype('<M8[ns]')

In [28]:
df.date_of_joining.dtype

dtype('<M8[ns]')

In [35]:
%%sql
drop table if exists employee;
create table employee(ID integer,
                     first_name varchar(20),
                     last_name varchar(20),
                     gender varchar(2),
                     salary integer,
                     level integer,
                      date_of_joining date);
insert into employee 
values(1, 'Peter',    'Sanders',  'M', 10000, 2, '2020-03-10'),
       (2, 'Julie',    'Miller',   'F', 12000, 2, '2020-01-14'),
       (3, 'Rachel',   'Bray',     'F', 9000,  1, '2020-03-09'),
       (4, 'Priti',    'Agarwal',  'F', 10000, 2, '2020-03-01'),
       (5, 'David',    'Cox',      'M', 5000,  1, '2020-05-28'),
       (6, 'Helly',    'Raval',    'F', 8000,  1, '2020-06-19'),
       (7, 'John',     'Frank',    'M', 13000, 3, '2019-11-12'),
       (8, 'Mark',     'Franklin', 'M', 13500, 3, '2019-11-12'),
       (9, 'Cristina', 'Rel',      'F', 15000, 4, '2019-09-22'),
       (10, 'Brock',   'Murray',   'M', 11000, 2,' 2020-02-13');

 * sqlite://
Done.
Done.
10 rows affected.

[]

In [38]:
%%sql
select * from employee limit 5;

 * sqlite://
Done.

[(1, 'Peter', 'Sanders', 'M', 10000, 2, '2020-03-10'),
 (2, 'Julie', 'Miller', 'F', 12000, 2, '2020-01-14'),
 (3, 'Rachel', 'Bray', 'F', 9000, 1, '2020-03-09'),
 (4, 'Priti', 'Agarwal', 'F', 10000, 2, '2020-03-01'),
 (5, 'David', 'Cox', 'M', 5000, 1, '2020-05-28')]

In [39]:
df.head(5)

   ID first_name last_name gender  salary  level date_of_joining
0   1      Peter   Sanders      M   10000      2      2020-10-03
1   2      Julie    Miller      F   12000      2      2020-01-14
2   3     Rachel      Bray      F    9000      1      2020-09-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
4   5      David       Cox      M    5000      1      2020-05-28

In [44]:
%%sql
select *from employee where gender == 'F';

 * sqlite://
Done.

[(2, 'Julie', 'Miller', 'F', 12000, 2, '2020-01-14'),
 (3, 'Rachel', 'Bray', 'F', 9000, 1, '2020-03-09'),
 (4, 'Priti', 'Agarwal', 'F', 10000, 2, '2020-03-01'),
 (6, 'Helly', 'Raval', 'F', 8000, 1, '2020-06-19'),
 (9, 'Cristina', 'Rel', 'F', 15000, 4, '2019-09-22')]

In [47]:
df[df.gender=='F']

   ID first_name last_name gender  salary  level date_of_joining
1   2      Julie    Miller      F   12000      2      2020-01-14
2   3     Rachel      Bray      F    9000      1      2020-09-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
5   6      Helly     Raval      F    8000      1      2020-06-19
8   9   Cristina       Rel      F   15000      4      2019-09-22

In [49]:
%%sql
select ID, first_name, last_name from employee;

 * sqlite://
Done.

[(1, 'Peter', 'Sanders'),
 (2, 'Julie', 'Miller'),
 (3, 'Rachel', 'Bray'),
 (4, 'Priti', 'Agarwal'),
 (5, 'David', 'Cox'),
 (6, 'Helly', 'Raval'),
 (7, 'John', 'Frank'),
 (8, 'Mark', 'Franklin'),
 (9, 'Cristina', 'Rel'),
 (10, 'Brock', 'Murray')]

In [50]:
df[['ID', 'first_name', 'last_name']]

   ID first_name last_name
0   1      Peter   Sanders
1   2      Julie    Miller
2   3     Rachel      Bray
3   4      Priti   Agarwal
4   5      David       Cox
5   6      Helly     Raval
6   7       John     Frank
7   8       Mark  Franklin
8   9   Cristina       Rel
9  10      Brock    Murray

In [53]:
%%sql
select * from employee order by salary desc;

 * sqlite://
Done.

[(9, 'Cristina', 'Rel', 'F', 15000, 4, '2019-09-22'),
 (8, 'Mark', 'Franklin', 'M', 13500, 3, '2019-11-12'),
 (7, 'John', 'Frank', 'M', 13000, 3, '2019-11-12'),
 (2, 'Julie', 'Miller', 'F', 12000, 2, '2020-01-14'),
 (10, 'Brock', 'Murray', 'M', 11000, 2, ' 2020-02-13'),
 (1, 'Peter', 'Sanders', 'M', 10000, 2, '2020-03-10'),
 (4, 'Priti', 'Agarwal', 'F', 10000, 2, '2020-03-01'),
 (3, 'Rachel', 'Bray', 'F', 9000, 1, '2020-03-09'),
 (6, 'Helly', 'Raval', 'F', 8000, 1, '2020-06-19'),
 (5, 'David', 'Cox', 'M', 5000, 1, '2020-05-28')]

In [54]:
df

   ID first_name last_name gender  salary  level date_of_joining
0   1      Peter   Sanders      M   10000      2      2020-10-03
1   2      Julie    Miller      F   12000      2      2020-01-14
2   3     Rachel      Bray      F    9000      1      2020-09-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
4   5      David       Cox      M    5000      1      2020-05-28
5   6      Helly     Raval      F    8000      1      2020-06-19
6   7       John     Frank      M   13000      3      2019-12-11
7   8       Mark  Franklin      M   13500      3      2019-12-11
8   9   Cristina       Rel      F   15000      4      2019-09-22
9  10      Brock    Murray      M   11000      2      2020-02-13

In [57]:
df.sort_values(by='salary', ascending=False)

   ID first_name last_name gender  salary  level date_of_joining
8   9   Cristina       Rel      F   15000      4      2019-09-22
7   8       Mark  Franklin      M   13500      3      2019-12-11
6   7       John     Frank      M   13000      3      2019-12-11
1   2      Julie    Miller      F   12000      2      2020-01-14
9  10      Brock    Murray      M   11000      2      2020-02-13
0   1      Peter   Sanders      M   10000      2      2020-10-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
2   3     Rachel      Bray      F    9000      1      2020-09-03
5   6      Helly     Raval      F    8000      1      2020-06-19
4   5      David       Cox      M    5000      1      2020-05-28

In [69]:
%%sql
select level, round(avg(salary),2) as average_salary, count(*) as count
from employee 
group by level;

 * sqlite://
Done.

[(1, 7333.33, 3), (2, 10750.0, 4), (3, 13250.0, 2), (4, 15000.0, 1)]

In [77]:
df.groupby('level').agg({'salary':'mean', 'ID':'size'})

             salary  ID
level
1       7333.333333   3
2      10750.000000   4
3      13250.000000   2
4      15000.000000   1

In [73]:
df

   ID first_name last_name gender  salary  level date_of_joining
0   1      Peter   Sanders      M   10000      2      2020-10-03
1   2      Julie    Miller      F   12000      2      2020-01-14
2   3     Rachel      Bray      F    9000      1      2020-09-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
4   5      David       Cox      M    5000      1      2020-05-28
5   6      Helly     Raval      F    8000      1      2020-06-19
6   7       John     Frank      M   13000      3      2019-12-11
7   8       Mark  Franklin      M   13500      3      2019-12-11
8   9   Cristina       Rel      F   15000      4      2019-09-22
9  10      Brock    Murray      M   11000      2      2020-02-13

In [81]:
%%sql
select distinct level from employee;

 * sqlite://
Done.

[(2,), (1,), (3,), (4,)]

In [85]:
%%sql
select count(distinct level) as count1 from employee;

 * sqlite://
Done.

[(4,)]

In [88]:
df.level.unique()

array([2, 1, 3, 4], dtype=int64)

In [94]:
df['level'].nunique()

4

In [95]:
df

   ID first_name last_name gender  salary  level date_of_joining
0   1      Peter   Sanders      M   10000      2      2020-10-03
1   2      Julie    Miller      F   12000      2      2020-01-14
2   3     Rachel      Bray      F    9000      1      2020-09-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
4   5      David       Cox      M    5000      1      2020-05-28
5   6      Helly     Raval      F    8000      1      2020-06-19
6   7       John     Frank      M   13000      3      2019-12-11
7   8       Mark  Franklin      M   13500      3      2019-12-11
8   9   Cristina       Rel      F   15000      4      2019-09-22
9  10      Brock    Murray      M   11000      2      2020-02-13

In [96]:
df.shape

(10, 7)

In [99]:
%%sql 
select count(*) as employee_count from employee;

 * sqlite://
Done.

[(10,)]

In [100]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\skme2\anaconda3\lib\site-packages (0.25.3)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\skme2\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.13.3 in c:\users\skme2\anaconda3\lib\site-packages (from pandas) (1.23.3)
Requirement already satisfied: pytz>=2017.2 in c:\users\skme2\anaconda3\lib\site-packages (from pandas) (2022.2.1)
Requirement already satisfied: six>=1.5 in c:\users\skme2\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.16.0)

In [101]:
import pandas as pd

In [102]:
book_title = ['C++', 'Java', 'Python', 'JavaScript']

In [104]:
book_title  = pd.Series(book_title)

In [105]:
book_title

0           C++
1          Java
2        Python
3    JavaScript
dtype: object

In [106]:
type(book_title)

pandas.core.series.Series

In [107]:
book_title[2]

'Python'

In [108]:
book_title

0           C++
1          Java
2        Python
3    JavaScript
dtype: object

In [110]:
book_title.index = ['a', 'b', 'c', 'd']

In [111]:
book_title

a           C++
b          Java
c        Python
d    JavaScript
dtype: object

In [112]:
book_title['c']

'Python'

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [5]:
arr = np.random.randint(10,100,size = (6,4))

In [7]:
arr

array([[91, 24, 44, 31],
       [21, 35, 18, 56],
       [32, 77, 44, 24],
       [49, 67, 99, 88],
       [52, 13, 52, 15],
       [45, 69, 23, 19]])

In [9]:
df = pd.DataFrame(arr)

In [11]:
type(df)

pandas.core.frame.DataFrame

In [14]:
type(df[2])

pandas.core.series.Series

In [16]:
type(df[0])

pandas.core.series.Series

In [20]:
df.columns = ["A", "B", "C", "D"]

In [21]:
df

    A   B   C   D
0  91  24  44  31
1  21  35  18  56
2  32  77  44  24
3  49  67  99  88
4  52  13  52  15
5  45  69  23  19

In [23]:
df['D']

0    31
1    56
2    24
3    88
4    15
5    19
Name: D, dtype: int32

In [24]:
df.shape

(6, 4)

In [27]:
df.head(3)

    A   B   C   D
0  91  24  44  31
1  21  35  18  56
2  32  77  44  24

In [29]:
df.tail(2)

    A   B   C   D
4  52  13  52  15
5  45  69  23  19

In [30]:
df['C']

0    44
1    18
2    44
3    99
4    52
5    23
Name: C, dtype: int32

In [33]:
df[['C', 'D']]

    C   D
0  44  31
1  18  56
2  44  24
3  99  88
4  52  15
5  23  19

In [36]:
df[['B', 'D', 'A']]

    B   D   A
0  24  31  91
1  35  56  21
2  77  24  32
3  67  88  49
4  13  15  52
5  69  19  45

In [38]:
df['A+B'] = df['A'] + df['B']

In [39]:
df

    A   B   C   D  A+B
0  91  24  44  31  115
1  21  35  18  56   56
2  32  77  44  24  109
3  49  67  99  88  116
4  52  13  52  15   65
5  45  69  23  19  114

In [41]:
df['A-B'] = df['A'] * df['B']

In [42]:
df

    A   B   C   D  A+B   A-B
0  91  24  44  31  115  2184
1  21  35  18  56   56   735
2  32  77  44  24  109  2464
3  49  67  99  88  116  3283
4  52  13  52  15   65   676
5  45  69  23  19  114  3105

In [45]:
df.drop(columns='A-B', inplace=True)

In [46]:
df

    A   B   C   D  A+B
0  91  24  44  31  115
1  21  35  18  56   56
2  32  77  44  24  109
3  49  67  99  88  116
4  52  13  52  15   65
5  45  69  23  19  114

In [50]:
r = "p q r r t u".split()

In [51]:
df.index = r

In [52]:
df

    A   B   C   D  A+B
p  91  24  44  31  115
q  21  35  18  56   56
r  32  77  44  24  109
r  49  67  99  88  116
t  52  13  52  15   65
u  45  69  23  19  114

In [55]:
df.loc['p']

A       91
B       24
C       44
D       31
A+B    115
Name: p, dtype: int32

In [56]:
df.loc['t']

A      52
B      13
C      52
D      15
A+B    65
Name: t, dtype: int32

In [57]:
df.iloc[0]

A       91
B       24
C       44
D       31
A+B    115
Name: p, dtype: int32

In [58]:
df.iloc[4]

A      52
B      13
C      52
D      15
A+B    65
Name: t, dtype: int32

In [59]:
df.iloc[5]

A       45
B       69
C       23
D       19
A+B    114
Name: u, dtype: int32

In [60]:
df

    A   B   C   D  A+B
p  91  24  44  31  115
q  21  35  18  56   56
r  32  77  44  24  109
r  49  67  99  88  116
t  52  13  52  15   65
u  45  69  23  19  114

In [61]:
df.iloc[1:4]

    A   B   C   D  A+B
q  21  35  18  56   56
r  32  77  44  24  109
r  49  67  99  88  116

In [65]:
df.iloc[2:5][['A','B']]

    A   B
r  32  77
r  49  67
t  52  13

In [70]:
df.iloc[-2:][['D', 'A+B']]

    D  A+B
t  15   65
u  19  114

In [75]:
df.iloc[-2:,-2:]

    D  A+B
t  15   65
u  19  114

In [80]:
df.iloc[4:, -2:]

    D  A+B
t  15   65
u  19  114

In [81]:
df

    A   B   C   D  A+B
p  91  24  44  31  115
q  21  35  18  56   56
r  32  77  44  24  109
r  49  67  99  88  116
t  52  13  52  15   65
u  45  69  23  19  114

In [83]:
mask = df>30

In [84]:
mask

       A      B      C      D   A+B
p   True  False   True   True  True
q  False   True  False   True  True
r   True   True   True  False  True
r   True   True   True   True  True
t   True  False   True  False  True
u   True   True  False  False  True

In [85]:
df[mask]

      A     B     C     D  A+B
p  91.0   NaN  44.0  31.0  115
q   NaN  35.0   NaN  56.0   56
r  32.0  77.0  44.0   NaN  109
r  49.0  67.0  99.0  88.0  116
t  52.0   NaN  52.0   NaN   65
u  45.0  69.0   NaN   NaN  114

In [88]:
df[df>30]

      A     B     C     D  A+B
p  91.0   NaN  44.0  31.0  115
q   NaN  35.0   NaN  56.0   56
r  32.0  77.0  44.0   NaN  109
r  49.0  67.0  99.0  88.0  116
t  52.0   NaN  52.0   NaN   65
u  45.0  69.0   NaN   NaN  114

In [92]:
df[df.B>40]

    A   B   C   D  A+B
r  32  77  44  24  109
r  49  67  99  88  116
u  45  69  23  19  114

In [98]:
df[df['B']>40][['C', 'D']]

    C   D
r  44  24
r  99  88
u  23  19

In [100]:
df.A>40

p     True
q    False
r    False
r     True
t     True
u     True
Name: A, dtype: bool

In [102]:
df.D<50

p     True
q    False
r     True
r    False
t     True
u     True
Name: D, dtype: bool

In [108]:
df[(df['A']>40) & (df['D']<50)]

    A   B   C   D  A+B
p  91  24  44  31  115
t  52  13  52  15   65
u  45  69  23  19  114

In [109]:
df

    A   B   C   D  A+B
p  91  24  44  31  115
q  21  35  18  56   56
r  32  77  44  24  109
r  49  67  99  88  116
t  52  13  52  15   65
u  45  69  23  19  114

In [113]:
again_arr = df.values

In [111]:
df.columns

Index(['A', 'B', 'C', 'D', 'A+B'], dtype='object')

In [112]:
df.index

Index(['p', 'q', 'r', 'r', 't', 'u'], dtype='object')

In [114]:
again_arr

array([[ 91,  24,  44,  31, 115],
       [ 21,  35,  18,  56,  56],
       [ 32,  77,  44,  24, 109],
       [ 49,  67,  99,  88, 116],
       [ 52,  13,  52,  15,  65],
       [ 45,  69,  23,  19, 114]])

In [117]:
ls

 Volume in drive C is OS
 Volume Serial Number is 0CC1-C20F

 Directory of C:\Users\skme2\Downloads

08-10-2022  12:25    <DIR>          .
08-10-2022  12:25    <DIR>          ..
07-10-2022  21:22    <DIR>          .ipynb_checkpoints
17-09-2022  13:06    <DIR>          __pycache__
16-09-2022  19:48         7,070,153 100-Business-English-Expressions.pdf
23-09-2022  08:41         1,139,062 101-Essays-That-Will-Change-The-Way-You-Think_.pdf
16-06-2022  12:41           885,091 1655188476743.pdf
16-06-2022  12:41           821,305 1655303783088.pdf
16-06-2022  12:42           805,584 1655361164152.pdf
24-06-2022  11:57         1,554,236 1655729738530.pdf
22-06-2022  11:00         2,858,697 1655808683836.pdf
22-06-2022  10:01           474,528 1655817362570.pdf
31-07-2022  23:27           194,662 1659268223394.pdf
01-08-2022  12:03           202,563 1659327300591.pdf
19-08-2022  11:56            95,777 1660554784534.pdf
31-08-2022  14:56            76,256 1660633425891.pdf
20-08-2022  13:03           278,174 1660706504763.pdf
18-08-2022  12:25         2,285,675 1660796239124.pdf
20-08-2022  13:03           290,834 1660964997593.pdf
28-08-2022  23:57            84,072 1661491570743.pdf
03-09-2022  11:57        24,347,918 1662176194924.pdf
11-09-2022  19:15         3,089,241 1662895783938.pdf
29-09-2022  05:57         5,227,782 1-deep learning (1).pdf
18-08-2022  17:45         5,227,782 1-deep learning.pdf
19-07-2022  21:09         5,812,051 1-Simple Linearregression.pdf
07-10-2022  21:35           694,907 1st Oct Data Science industry(3-Git ).pdf
16-09-2022  19:46         1,477,146 2127.pdf
03-07-2022  11:53    <DIR>          21stMay-20220702T055745Z-001
03-07-2022  11:53    <DIR>          22ndmay-20220702T055801Z-001
10-09-2022  23:12    <DIR>          23. Django-20220910T174146Z-001
10-09-2022  23:12           635,343 23. Django-20220910T174146Z-001.zip
07-10-2022  21:35         2,513,681 25th Sept Industry ready 1-DS Project Flow.pdf
03-07-2022  11:53    <DIR>          28thmay-20220702T055846Z-001
03-07-2022  11:53    <DIR>          29thMay-20220702T055900Z-001
29-09-2022  05:58         4,936,410 2-Deep Learning-Activation Function,Loss Function,vanishing gradient problems.pdf
19-07-2022  22:15         6,177,864 2-RidgeLassoelasticLogistic.pdf
29-09-2022  06:00         3,811,002 3- Deep Learning optimizers.pdf
20-07-2022  20:30         4,476,715 3-NaiveBayes&KNN (1).pdf
06-08-2022  20:04            46,783 48d054d7-9ca9-41a2-af20-6da22f7b1687.pdf
03-07-2022  11:53    <DIR>          5thJune-20220702T060018Z-001
03-09-2022  11:53           543,608 6a2d2d74-fd47-4c8e-9305-83c33f35b46f.pdf
02-07-2022  11:30         7,136,886 8-Gradientboosting-kmeanshierarichal.pdf
29-06-2022  17:02         6,328,057 8thJanStats3.pdf
29-06-2022  17:02         6,662,750 9thJanStats4.pdf
29-09-2022  05:59         3,253,779 activation function.zip
04-08-2022  21:13           510,875 aPI.pdf
29-09-2022  06:11         1,416,716 Apple+quarterly+balance+sheet.pdf
29-09-2022  06:11         1,429,366 Apple+quarterly+balance+sheet+1.pdf
02-09-2022  17:49    <DIR>          archive
03-09-2022  13:06    <DIR>          archive (1)
03-09-2022  13:05           641,269 archive (1).zip
02-09-2022  17:48         5,732,543 archive.zip
10-09-2022  17:43            62,580 arseny-togulev-kGix6_gPKjI-unsplash.jpg
29-09-2022  19:54        10,401,953 assignment (2) (2).xlsx
30-07-2022  22:27           104,846 atlassian-git-cheatsheet.pdf
07-10-2022  17:31             2,281 Car Price prediction.ipynb
07-10-2022  17:33            26,717 CarPrice_Assignment.csv
27-09-2022  15:06    <DIR>          Class_notebooks-20220927T091839Z-001
27-09-2022  14:49         3,661,484 Class_notebooks-20220927T091839Z-001.zip
03-09-2022  17:55           299,120 conda-cheatsheet (1).pdf
03-09-2022  17:55           787,695 conda-cheatsheet.pdf
01-08-2022  14:05         2,434,564 Crop Recommendation System Project.pdf
24-09-2022  21:51    <DIR>          Data
07-10-2022  17:17            14,884 Data Dictionary - carprices.xlsx
24-09-2022  21:50           709,466 Data.zip
31-07-2022  18:17       372,798,464 database1.sqlite
13-09-2022  21:40        24,741,696 dataset (1).rar
13-09-2022  21:39        24,741,696 dataset.rar
05-08-2022  11:46         1,569,899 Deep learning (2).pdf
01-08-2022  14:05           378,488 Deep Learning.pdf
27-09-2022  18:35    <DIR>          Diabetes-prediction-project-main
27-09-2022  18:35         1,576,224 Diabetes-prediction-project-main.zip
27-09-2022  18:34           510,271 diabetes-prediction-rfc-model.pkl
09-09-2022  21:49    <DIR>          Django-Socialauth-master
09-09-2022  21:49           146,954 Django-Socialauth-master.zip
27-09-2022  15:06    <DIR>          DL1-20220927T091704Z-001
27-09-2022  14:47           134,638 DL1-20220927T091704Z-001.zip
23-09-2022  12:45       548,820,824 Docker Desktop Installer.exe
03-09-2022  19:23           143,755 docker-cheat-sheet.pdf
29-09-2022  06:11            20,859 employee_ctc_pdf_load_solved.xlsx
29-09-2022  06:12           203,553 Employee+data.pdf
31-08-2022  20:11    <DIR>          End-to-End-Diabetes-Prediction-Application-Using-Machine-Learning-master
21-07-2022  18:55                60 Example.txt
19-08-2022  14:20         1,513,112 Excel Analyticxs.pdf
24-09-2022  22:50    <DIR>          Exercise
24-09-2022  21:52        24,431,113 Exercise.zip
19-08-2022  13:38               230 Fabionacci.py
16-09-2022  19:48        14,064,278 FifteenThousandUsefulPhrases_10777354.pdf
06-09-2022  06:08    <DIR>          flask_demo-20220905T235450Z-001
06-09-2022  05:25             7,623 flask_demo-20220905T235450Z-001.zip
06-09-2022  15:06    <DIR>          Flaskpractice
05-09-2022  15:06    <DIR>          Flight-Price-Prediction-master
30-07-2022  22:24        49,381,480 Git-2.37.1-64-bit (1).exe
30-07-2022  13:08        49,381,480 Git-2.37.1-64-bit.exe
01-10-2022  10:14        49,375,864 Git-2.37.3-64-bit.exe
30-07-2022  22:26           100,194 git-cheat-sheet-education.pdf
12-09-2022  19:34                29 gog.py
27-07-2022  19:31           930,127 haarcascade_frontalface_default.xml
27-07-2022  20:42           188,506 haarcascade_smile.xml
19-08-2022  13:40                41 hello.py
14-09-2022  13:24                32 helloworld.py
19-08-2022  17:17                29 infile.py
18-08-2022  22:59            73,216 inter.jfif
10-08-2022  20:13           277,130 Internship Certificate internship certi.pdf
13-09-2022  21:58         1,160,337 introduction.pptx
05-09-2022  17:49           644,465 JD Python Developer Speech  - Ozonetel - Sudhamay Maity.pdf
16-09-2022  19:47           447,946 Job-Interviews-In-English_Series-One-Pack.pdf
16-09-2022  19:44           582,510 KEY_PHRASES_FOR_INTERVIEWS.pdf
20-09-2022  19:22         6,631,527 KMS_Pico_Full_Setup.zip
08-10-2022  12:25           128,573 libraries revision 2.ipynb
23-09-2022  14:12           412,306 Linkresume.pdf
07-10-2022  12:34           469,423 Linuc commands.pdf
25-08-2022  11:13           469,423 Linux commands.pdf
31-08-2022  19:46    <DIR>          Machine-Learning-Projects-master
31-08-2022  19:41       122,583,229 Machine-Learning-Projects-master.zip
03-09-2022  14:26         4,115,949 ML NOtes.pdf
21-09-2022  20:30         2,063,991 ML1.ipynb
23-09-2022  14:34    <DIR>          ML11 4-20220923T083136Z-001
12-09-2022  19:35    <DIR>          mod1
21-07-2022  17:49               103 my_custom.py
07-10-2022  17:41            27,405 mycsv.csv
17-09-2022  13:06               219 mymodule.py
15-09-2022  21:22           411,545 new_link resume.pdf
24-09-2022  18:39           774,608 new_link resume_page-0001.jpg
11-09-2022  11:16    <DIR>          newdjango
23-07-2022  12:59               133 newonefile.txt
20-09-2022  18:33           170,384 nresume.pdf
30-07-2022  11:40           280,866 NUMPY Cheatsheet.pdf
27-07-2022  19:31        10,269,576 opencv_haarcascade_frontalface_default.xml at master  opencv_opencv.html
27-07-2022  19:31    <DIR>          opencv_haarcascade_frontalface_default.xml at master  opencv_opencv_files
19-08-2022  17:21                51 outfile.py
24-09-2022  10:20    <DIR>          p1
03-09-2022  19:21           118,785 p2.jpeg
29-09-2022  06:11            17,654 PDF_import_solved.xlsx
19-09-2022  18:42         1,180,881 Pima_diabetes_Tree.png
17-09-2022  10:41    <DIR>          PowerBi Project-20220917T050125Z-001
24-09-2022  21:52    <DIR>          Presentations
24-09-2022  21:52         1,317,567 Presentations.zip
24-09-2022  16:20    <DIR>          Product-20211124T053757Z-001
24-09-2022  16:19        19,548,195 Product-20211124T053757Z-001.zip
29-07-2022  20:09         2,161,950 project discussion.pdf
05-09-2022  15:16    <DIR>          Projects
03-09-2022  12:31            17,861 Proposal 8 26.docx
14-09-2022  13:11               588 Python projects1.ipynb
08-08-2022  00:04               588 Pytorch.ipynb
30-08-2022  21:07                56 samplejson.json
02-07-2022  20:33           101,973 Scaler.ipynb
26-09-2022  05:51            26,456 Session9_Exercise.xlsx
26-09-2022  14:42            73,387 Session9_Solution.xlsx
17-09-2022  11:03    <DIR>          Spend-20211123T045440Z-001.zip (Unzipped Files)-20220917T052232Z-001
28-06-2022  15:57         1,563,052 SQL EXCLUSIVE NOTES .pdf
01-08-2022  14:05         1,000,464 SQL interview preparation sheet.pdf
13-08-2022  11:16         3,677,483 SQL.pdf
29-06-2022  17:01         5,760,923 stats1.pdf
29-06-2022  17:02         5,964,062 stats2.pdf
29-06-2022  17:02         6,829,549 stats5.pdf
30-07-2022  13:19            71,399 SWTM-2088_Atlassian-Git-Cheatsheet.pdf
14-08-2022  18:48           479,882 Task Details.pdf
01-10-2022  21:34    <DIR>          Telegram Desktop
26-08-2022  22:20                33 test.txt.txt
23-09-2022  17:37    <DIR>          time series-20220923T120550Z-001
23-09-2022  14:34    <DIR>          timeSeries-20220923T083150Z-001
01-10-2022  17:13    <DIR>          Truefun_assignment
01-10-2022  21:27        37,431,504 tsetup-x64.4.2.4.exe
19-08-2022  13:36                 0 untitled
22-08-2022  13:56                 0 untitled.txt
30-07-2022  00:38           153,011 Wafer Fault Detection.ipynb
03-09-2022  19:18           133,642 WhatsApp Image 2022-09-03 at 7.18.32 PM.jpeg
             131 File(s)  1,544,540,112 bytes
              37 Dir(s)  834,467,684,352 bytes free

In [1]:
#import seaborn as sns
import pandas as pd
import numpy as np

In [114]:
df  = pd.read_csv('https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/0e7a9b0a5d22642a06d3d5b9bcbad9890c8ee534/iris.csv')

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [5]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [6]:
df.shape

(150, 5)

In [7]:
df.values

array([[5.1, 3.5, 1.4, 0.2, 'setosa'],
       [4.9, 3.0, 1.4, 0.2, 'setosa'],
       [4.7, 3.2, 1.3, 0.2, 'setosa'],
       [4.6, 3.1, 1.5, 0.2, 'setosa'],
       [5.0, 3.6, 1.4, 0.2, 'setosa'],
       [5.4, 3.9, 1.7, 0.4, 'setosa'],
       [4.6, 3.4, 1.4, 0.3, 'setosa'],
       [5.0, 3.4, 1.5, 0.2, 'setosa'],
       [4.4, 2.9, 1.4, 0.2, 'setosa'],
       [4.9, 3.1, 1.5, 0.1, 'setosa'],
       [5.4, 3.7, 1.5, 0.2, 'setosa'],
       [4.8, 3.4, 1.6, 0.2, 'setosa'],
       [4.8, 3.0, 1.4, 0.1, 'setosa'],
       [4.3, 3.0, 1.1, 0.1, 'setosa'],
       [5.8, 4.0, 1.2, 0.2, 'setosa'],
       [5.7, 4.4, 1.5, 0.4, 'setosa'],
       [5.4, 3.9, 1.3, 0.4, 'setosa'],
       [5.1, 3.5, 1.4, 0.3, 'setosa'],
       [5.7, 3.8, 1.7, 0.3, 'setosa'],
       [5.1, 3.8, 1.5, 0.3, 'setosa'],
       [5.4, 3.4, 1.7, 0.2, 'setosa'],
       [5.1, 3.7, 1.5, 0.4, 'setosa'],
       [4.6, 3.6, 1.0, 0.2, 'setosa'],
       [5.1, 3.3, 1.7, 0.5, 'setosa'],
       [4.8, 3.4, 1.9, 0.2, 'setosa'],
       [5.0, 3.0, 1.6, 0.2, 'setosa'],
       [5.0, 3.4, 1.6, 0.4, 'setosa'],
       [5.2, 3.5, 1.5, 0.2, 'setosa'],
       [5.2, 3.4, 1.4, 0.2, 'setosa'],
       [4.7, 3.2, 1.6, 0.2, 'setosa'],
       [4.8, 3.1, 1.6, 0.2, 'setosa'],
       [5.4, 3.4, 1.5, 0.4, 'setosa'],
       [5.2, 4.1, 1.5, 0.1, 'setosa'],
       [5.5, 4.2, 1.4, 0.2, 'setosa'],
       [4.9, 3.1, 1.5, 0.1, 'setosa'],
       [5.0, 3.2, 1.2, 0.2, 'setosa'],
       [5.5, 3.5, 1.3, 0.2, 'setosa'],
       [4.9, 3.1, 1.5, 0.1, 'setosa'],
       [4.4, 3.0, 1.3, 0.2, 'setosa'],
       [5.1, 3.4, 1.5, 0.2, 'setosa'],
       [5.0, 3.5, 1.3, 0.3, 'setosa'],
       [4.5, 2.3, 1.3, 0.3, 'setosa'],
       [4.4, 3.2, 1.3, 0.2, 'setosa'],
       [5.0, 3.5, 1.6, 0.6, 'setosa'],
       [5.1, 3.8, 1.9, 0.4, 'setosa'],
       [4.8, 3.0, 1.4, 0.3, 'setosa'],
       [5.1, 3.8, 1.6, 0.2, 'setosa'],
       [4.6, 3.2, 1.4, 0.2, 'setosa'],
       [5.3, 3.7, 1.5, 0.2, 'setosa'],
       [5.0, 3.3, 1.4, 0.2, 'setosa'],
       [7.0, 3.2, 4.7, 1.4, 'versicolor'],
       [6.4, 3.2, 4.5, 1.5, 'versicolor'],
       [6.9, 3.1, 4.9, 1.5, 'versicolor'],
       [5.5, 2.3, 4.0, 1.3, 'versicolor'],
       [6.5, 2.8, 4.6, 1.5, 'versicolor'],
       [5.7, 2.8, 4.5, 1.3, 'versicolor'],
       [6.3, 3.3, 4.7, 1.6, 'versicolor'],
       [4.9, 2.4, 3.3, 1.0, 'versicolor'],
       [6.6, 2.9, 4.6, 1.3, 'versicolor'],
       [5.2, 2.7, 3.9, 1.4, 'versicolor'],
       [5.0, 2.0, 3.5, 1.0, 'versicolor'],
       [5.9, 3.0, 4.2, 1.5, 'versicolor'],
       [6.0, 2.2, 4.0, 1.0, 'versicolor'],
       [6.1, 2.9, 4.7, 1.4, 'versicolor'],
       [5.6, 2.9, 3.6, 1.3, 'versicolor'],
       [6.7, 3.1, 4.4, 1.4, 'versicolor'],
       [5.6, 3.0, 4.5, 1.5, 'versicolor'],
       [5.8, 2.7, 4.1, 1.0, 'versicolor'],
       [6.2, 2.2, 4.5, 1.5, 'versicolor'],
       [5.6, 2.5, 3.9, 1.1, 'versicolor'],
       [5.9, 3.2, 4.8, 1.8, 'versicolor'],
       [6.1, 2.8, 4.0, 1.3, 'versicolor'],
       [6.3, 2.5, 4.9, 1.5, 'versicolor'],
       [6.1, 2.8, 4.7, 1.2, 'versicolor'],
       [6.4, 2.9, 4.3, 1.3, 'versicolor'],
       [6.6, 3.0, 4.4, 1.4, 'versicolor'],
       [6.8, 2.8, 4.8, 1.4, 'versicolor'],
       [6.7, 3.0, 5.0, 1.7, 'versicolor'],
       [6.0, 2.9, 4.5, 1.5, 'versicolor'],
       [5.7, 2.6, 3.5, 1.0, 'versicolor'],
       [5.5, 2.4, 3.8, 1.1, 'versicolor'],
       [5.5, 2.4, 3.7, 1.0, 'versicolor'],
       [5.8, 2.7, 3.9, 1.2, 'versicolor'],
       [6.0, 2.7, 5.1, 1.6, 'versicolor'],
       [5.4, 3.0, 4.5, 1.5, 'versicolor'],
       [6.0, 3.4, 4.5, 1.6, 'versicolor'],
       [6.7, 3.1, 4.7, 1.5, 'versicolor'],
       [6.3, 2.3, 4.4, 1.3, 'versicolor'],
       [5.6, 3.0, 4.1, 1.3, 'versicolor'],
       [5.5, 2.5, 4.0, 1.3, 'versicolor'],
       [5.5, 2.6, 4.4, 1.2, 'versicolor'],
       [6.1, 3.0, 4.6, 1.4, 'versicolor'],
       [5.8, 2.6, 4.0, 1.2, 'versicolor'],
       [5.0, 2.3, 3.3, 1.0, 'versicolor'],
       [5.6, 2.7, 4.2, 1.3, 'versicolor'],
       [5.7, 3.0, 4.2, 1.2, 'versicolor'],
       [5.7, 2.9, 4.2, 1.3, 'versicolor'],
       [6.2, 2.9, 4.3, 1.3, 'versicolor'],
       [5.1, 2.5, 3.0, 1.1, 'versicolor'],
       [5.7, 2.8, 4.1, 1.3, 'versicolor'],
       [6.3, 3.3, 6.0, 2.5, 'virginica'],
       [5.8, 2.7, 5.1, 1.9, 'virginica'],
       [7.1, 3.0, 5.9, 2.1, 'virginica'],
       [6.3, 2.9, 5.6, 1.8, 'virginica'],
       [6.5, 3.0, 5.8, 2.2, 'virginica'],
       [7.6, 3.0, 6.6, 2.1, 'virginica'],
       [4.9, 2.5, 4.5, 1.7, 'virginica'],
       [7.3, 2.9, 6.3, 1.8, 'virginica'],
       [6.7, 2.5, 5.8, 1.8, 'virginica'],
       [7.2, 3.6, 6.1, 2.5, 'virginica'],
       [6.5, 3.2, 5.1, 2.0, 'virginica'],
       [6.4, 2.7, 5.3, 1.9, 'virginica'],
       [6.8, 3.0, 5.5, 2.1, 'virginica'],
       [5.7, 2.5, 5.0, 2.0, 'virginica'],
       [5.8, 2.8, 5.1, 2.4, 'virginica'],
       [6.4, 3.2, 5.3, 2.3, 'virginica'],
       [6.5, 3.0, 5.5, 1.8, 'virginica'],
       [7.7, 3.8, 6.7, 2.2, 'virginica'],
       [7.7, 2.6, 6.9, 2.3, 'virginica'],
       [6.0, 2.2, 5.0, 1.5, 'virginica'],
       [6.9, 3.2, 5.7, 2.3, 'virginica'],
       [5.6, 2.8, 4.9, 2.0, 'virginica'],
       [7.7, 2.8, 6.7, 2.0, 'virginica'],
       [6.3, 2.7, 4.9, 1.8, 'virginica'],
       [6.7, 3.3, 5.7, 2.1, 'virginica'],
       [7.2, 3.2, 6.0, 1.8, 'virginica'],
       [6.2, 2.8, 4.8, 1.8, 'virginica'],
       [6.1, 3.0, 4.9, 1.8, 'virginica'],
       [6.4, 2.8, 5.6, 2.1, 'virginica'],
       [7.2, 3.0, 5.8, 1.6, 'virginica'],
       [7.4, 2.8, 6.1, 1.9, 'virginica'],
       [7.9, 3.8, 6.4, 2.0, 'virginica'],
       [6.4, 2.8, 5.6, 2.2, 'virginica'],
       [6.3, 2.8, 5.1, 1.5, 'virginica'],
       [6.1, 2.6, 5.6, 1.4, 'virginica'],
       [7.7, 3.0, 6.1, 2.3, 'virginica'],
       [6.3, 3.4, 5.6, 2.4, 'virginica'],
       [6.4, 3.1, 5.5, 1.8, 'virginica'],
       [6.0, 3.0, 4.8, 1.8, 'virginica'],
       [6.9, 3.1, 5.4, 2.1, 'virginica'],
       [6.7, 3.1, 5.6, 2.4, 'virginica'],
       [6.9, 3.1, 5.1, 2.3, 'virginica'],
       [5.8, 2.7, 5.1, 1.9, 'virginica'],
       [6.8, 3.2, 5.9, 2.3, 'virginica'],
       [6.7, 3.3, 5.7, 2.5, 'virginica'],
       [6.7, 3.0, 5.2, 2.3, 'virginica'],
       [6.3, 2.5, 5.0, 1.9, 'virginica'],
       [6.5, 3.0, 5.2, 2.0, 'virginica'],
       [6.2, 3.4, 5.4, 2.3, 'virginica'],
       [5.9, 3.0, 5.1, 1.8, 'virginica']], dtype=object)

In [8]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [10]:
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [11]:
df.info()

TypeError: Cannot interpret '<attribute 'dtype' of 'numpy.generic' objects>' as a data type

In [12]:
df.describe()

TypeError: Cannot interpret '<attribute 'dtype' of 'numpy.generic' objects>' as a data type

In [13]:
import numpy as np
print(np.__version__)

1.23.3

In [16]:
df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [17]:
df.species.nunique()

3

In [21]:
df[df.species == 'versicolor'].shape

(50, 5)

In [24]:
df.species.value_counts()['virginica']

50

In [27]:
df['sepal_length'].mean()

5.843333333333335

In [29]:
df.petal_width.max()

2.5

In [30]:
df.petal_width.min()

0.1

In [32]:
df.petal_width.sum()

179.8

In [33]:
df.petal_width

0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Name: petal_width, Length: 150, dtype: float64

In [36]:
df.sort_values(by=["sepal_length",'sepal_width'])

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
8             4.4          2.9           1.4          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
42            4.4          3.2           1.3          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

In [39]:
df.species.apply(len)

0      6
1      6
2      6
3      6
4      6
      ..
145    9
146    9
147    9
148    9
149    9
Name: species, Length: 150, dtype: int64

In [40]:
len('setosa')

6

In [41]:
len('virginica')

9

In [43]:
df.apply(lambda x:x+x)

     sepal_length  sepal_width  petal_length  petal_width             species
0            10.2          7.0           2.8          0.4        setosasetosa
1             9.8          6.0           2.8          0.4        setosasetosa
2             9.4          6.4           2.6          0.4        setosasetosa
3             9.2          6.2           3.0          0.4        setosasetosa
4            10.0          7.2           2.8          0.4        setosasetosa
..            ...          ...           ...          ...                 ...
145          13.4          6.0          10.4          4.6  virginicavirginica
146          12.6          5.0          10.0          3.8  virginicavirginica
147          13.0          6.0          10.4          4.0  virginicavirginica
148          12.4          6.8          10.8          4.6  virginicavirginica
149          11.8          6.0          10.2          3.6  virginicavirginica

[150 rows x 5 columns]

In [50]:
df.aggregate('min')

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [51]:
df.aggregate(['min', 'max', 'mean', 'median'])

        sepal_length  sepal_width  petal_length  petal_width    species
min         4.300000        2.000      1.000000     0.100000     setosa
max         7.900000        4.400      6.900000     2.500000  virginica
mean        5.843333        3.054      3.758667     1.198667        NaN
median      5.800000        3.000      4.350000     1.300000        NaN

In [53]:
group = df.groupby('species')

In [54]:
group.max()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.8          4.4           1.9          0.6
versicolor           7.0          3.4           5.1          1.8
virginica            7.9          3.8           6.9          2.5

In [55]:
group.max()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.8          4.4           1.9          0.6
versicolor           7.0          3.4           5.1          1.8
virginica            7.9          3.8           6.9          2.5

In [56]:
group.median()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0

In [57]:
group.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.418         1.464        0.244
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [65]:
(df[df.species == 'setosa'].sepal_length).mean()

5.005999999999999

In [66]:
group.count()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

In [67]:
group.sum()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             250.3        170.9          73.2         12.2
versicolor         296.8        138.5         213.0         66.3
virginica          329.4        148.7         277.6        101.3

In [69]:
group.describe().T

TypeError: Cannot interpret '<attribute 'dtype' of 'numpy.generic' objects>' as a data type

In [70]:
import warnings
warnings.filterwarnings('ignore')

In [142]:
nan_idx

array([ 54, 147, 123,   9, 102, 129,   9,  89,  66, 126, 139,  74,  53,
       118, 147, 120, 132,  13,  49, 129])

In [115]:
nan_idx = np.random.randint(0,150,20)

In [116]:
df['sepal_length'][nan_idx] = np.nan

In [117]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           NaN          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [98]:
df.petal_width.idx1 = np.nan

In [124]:
idx1 = np.random.randint(0,150,15)

In [119]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           NaN          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [127]:
df.petal_width[139]

2.1

In [125]:
idx1

array([104,   0, 109,  57,  11,  20,  12,  91,  77,  49,  18, 149,  29,
       128, 108])

In [126]:
df['petal_width'][idx1] = np.nan

In [128]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          NaN     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           NaN          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          NaN  virginica

[150 rows x 5 columns]

In [129]:
df.isna().sum()

sepal_length    17
sepal_width      0
petal_length     0
petal_width     30
species          0
dtype: int64

In [130]:
df.shape

(150, 5)

In [131]:
df.shape

(150, 5)

In [140]:
df['sepal_length'].fillna(value=round(df['sepal_length'].mean(),2), inplace=True)

In [138]:
round(df['sepal_length'].mean(),2)

5.8

In [141]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          NaN     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           5.8          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          NaN  virginica

[150 rows x 5 columns]

In [144]:
df.isna().sum()

sepal_length     0
sepal_width      0
petal_length     0
petal_width     30
species          0
dtype: int64

In [147]:
df['petal_width'].fillna(value=round(df['petal_width'].mean(),2), inplace=True)

In [148]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4         1.22     setosa
1             4.9          3.0           1.4         0.20     setosa
2             4.7          3.2           1.3         0.20     setosa
3             4.6          3.1           1.5         0.20     setosa
4             5.0          3.6           1.4         0.20     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2         2.30  virginica
146           6.3          2.5           5.0         1.90  virginica
147           5.8          3.0           5.2         2.00  virginica
148           6.2          3.4           5.4         2.30  virginica
149           5.9          3.0           5.1         1.22  virginica

[150 rows x 5 columns]

In [150]:
df.isna().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [155]:
new_df  = pd.DataFrame(np.random.randint(0,7,size = (10,4)))

In [156]:
new_df

   0  1  2  3
0  6  6  3  3
1  4  5  2  0
2  2  3  5  5
3  6  1  5  2
4  5  1  2  0
5  2  2  3  1
6  3  6  6  6
7  3  2  3  2
8  1  3  5  3
9  5  1  2  1

In [160]:
new_df['species'] = 'new-species'

In [161]:
new_df

   0  1  2  3      species
0  6  6  3  3  new-species
1  4  5  2  0  new-species
2  2  3  5  5  new-species
3  6  1  5  2  new-species
4  5  1  2  0  new-species
5  2  2  3  1  new-species
6  3  6  6  6  new-species
7  3  2  3  2  new-species
8  1  3  5  3  new-species
9  5  1  2  1  new-species

In [162]:
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [165]:
new_df.columns = df.columns

In [166]:
new_df

   sepal_length  sepal_width  petal_length  petal_width      species
0             6            6             3            3  new-species
1             4            5             2            0  new-species
2             2            3             5            5  new-species
3             6            1             5            2  new-species
4             5            1             2            0  new-species
5             2            2             3            1  new-species
6             3            6             6            6  new-species
7             3            2             3            2  new-species
8             1            3             5            3  new-species
9             5            1             2            1  new-species

In [168]:
df1 = pd.concat((df,new_df))

In [170]:
df1.shape

(160, 5)

In [175]:
df2 = pd.DataFrame({"s_name":['Mohit', 'Jatin', 'Prateek', 'Mohit'],
             "CGPA":[ 2 , 4, 5, 3]})

In [176]:
df3 = pd.DataFrame({'T_Name' : ['Mohit', 'Jatin', 'Prateek', 'Mohit'],
                    'CGPA' :  [ 3 , 6, 8, 9]})

In [178]:
df2.merge(df3, on = 'CGPA')

  s_name  CGPA T_Name
0  Mohit     3  Mohit

In [180]:
df2.merge(df3, how='left')

    s_name  CGPA T_Name
0    Mohit     2    NaN
1    Jatin     4    NaN
2  Prateek     5    NaN
3    Mohit     3  Mohit

In [182]:
df2.merge(df3, how='right')

  s_name  CGPA   T_Name
0  Mohit     3    Mohit
1    NaN     6    Jatin
2    NaN     8  Prateek
3    NaN     9    Mohit

In [184]:
df2.merge(df3, how='outer')

    s_name  CGPA   T_Name
0    Mohit     2      NaN
1    Jatin     4      NaN
2  Prateek     5      NaN
3    Mohit     3    Mohit
4      NaN     6    Jatin
5      NaN     8  Prateek
6      NaN     9    Mohit

In [186]:
df1

    sepal_length  sepal_width  petal_length  petal_width      species
0            5.1          3.5           1.4         1.22       setosa
1            4.9          3.0           1.4         0.20       setosa
2            4.7          3.2           1.3         0.20       setosa
3            4.6          3.1           1.5         0.20       setosa
4            5.0          3.6           1.4         0.20       setosa
..           ...          ...           ...          ...          ...
5            2.0          2.0           3.0         1.00  new-species
6            3.0          6.0           6.0         6.00  new-species
7            3.0          2.0           3.0         2.00  new-species
8            1.0          3.0           5.0         3.00  new-species
9            5.0          1.0           2.0         1.00  new-species

[160 rows x 5 columns]

In [188]:
df1.isna().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [190]:
df1.to_csv('mypandas152.csv', index= False)

In [192]:
modified_iris  = pd.read_csv('mypandas152.csv')

In [193]:
modified_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4         1.22  setosa
1           4.9          3.0           1.4         0.20  setosa
2           4.7          3.2           1.3         0.20  setosa
3           4.6          3.1           1.5         0.20  setosa
4           5.0          3.6           1.4         0.20  setosa

In [195]:
df1.to_excel('thisisexcelfile.xlsx', sheet_name='ironmanfile')

In [196]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\skme2\anaconda3\lib\site-packages (1.23.3)

In [197]:
import numpy as np

In [198]:
lst = [1,2,3,4,5,6,7,8,9,10]

In [202]:
%timeit [i**2 for i in lst]

1.92 s  32.1 ns per loop (mean  std. dev. of 7 runs, 100,000 loops each)

In [204]:
arr = np.array(lst)

In [208]:
%timeit arr**2

489 ns  15.1 ns per loop (mean  std. dev. of 7 runs, 1,000,000 loops each)

In [209]:
lst

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [212]:
lst + [1]

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 1]

In [214]:
arr + 1

array([ 2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [215]:
l = [1,5,8,9]

In [217]:
np_arr  = np.array(l)

In [218]:
np_arr

array([1, 5, 8, 9])

In [219]:
type(np_arr)

numpy.ndarray

In [220]:
np_arr.ndim

1

In [221]:
np_arr.shape

(4,)

In [224]:
list(range(0,15,3))

[0, 3, 6, 9, 12]

In [227]:
new_arr  = np.arange(3,11,2)

In [228]:
new_arr

array([3, 5, 7, 9])

In [230]:
lst_2d = [[1,2,3], [4,5,6], [7,8,9]]

In [231]:
type(lst_2d)

list

In [233]:
a1 =np.array(lst_2d)

In [235]:
a1.shape

(3, 3)

In [236]:
a1.ndim

2

In [248]:
z = np.zeros((5,5), dtype = np.int32)

In [245]:
o = np.ones((9,9), )

In [250]:
z.dtype

dtype('int32')

In [249]:
z

array([[0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0],
       [0, 0, 0, 0, 0]])

In [251]:
o

array([[1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1.]])

In [252]:
np.eye(9)

array([[1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 1.]])

In [253]:
np.identity(9)

array([[1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 1.]])

In [255]:
np.diag((6,6))

array([[6, 0],
       [0, 6]])

In [256]:
np.diag([1,2,25,36,100])

array([[  1,   0,   0,   0,   0],
       [  0,   2,   0,   0,   0],
       [  0,   0,  25,   0,   0],
       [  0,   0,   0,  36,   0],
       [  0,   0,   0,   0, 100]])

In [260]:
arr = np.random.randint(10,100, (5,4))

In [262]:
arr.shape

(5, 4)

In [264]:
arr[0]

array([39, 70, 56, 44])

In [265]:
arr[2]

array([75, 14, 20, 84])

In [266]:
arr

array([[39, 70, 56, 44],
       [17, 93, 68, 56],
       [75, 14, 20, 84],
       [56, 34, 24, 51],
       [59, 72, 23, 96]])

In [267]:
arr[-2]

array([56, 34, 24, 51])

In [269]:
arr[0,0]

39

In [274]:
arr[4,3]

96

In [275]:
arr

array([[39, 70, 56, 44],
       [17, 93, 68, 56],
       [75, 14, 20, 84],
       [56, 34, 24, 51],
       [59, 72, 23, 96]])

In [280]:
arr[2:,1:]

array([[14, 20, 84],
       [34, 24, 51],
       [72, 23, 96]])

In [284]:
arr[:,-1]

array([44, 56, 84, 51, 96])

In [289]:
arr[0,1] = 145

In [290]:
arr

array([[ 39, 145,  56,  44],
       [ 17,  93,  68,  56],
       [ 75,  14,  20,  84],
       [ 56,  34,  24,  51],
       [ 59,  72,  23,  96]])

In [295]:
mask = arr>10

In [296]:
mask.sum()

20

In [297]:
np.sum(mask)

20

In [300]:
arr[arr>10]

array([ 39, 145,  56,  44,  17,  93,  68,  56,  75,  14,  20,  84,  56,
        34,  24,  51,  59,  72,  23,  96])

In [306]:
arr[2:,2:] = 0

In [307]:
arr

array([[ 39, 145,  56,  44],
       [ 17,  93,  68,  56],
       [ 75,  14,   0,   0],
       [ 56,  34,   0,   0],
       [ 59,  72,   0,   0]])

In [309]:
a = np.array([10,20,30.,40])

In [311]:
b = np.arange(1,5)

In [312]:
a

array([10., 20., 30., 40.])

In [313]:
b

array([1, 2, 3, 4])

In [314]:
a+b

array([11., 22., 33., 44.])

In [315]:
a-b

array([ 9., 18., 27., 36.])

In [316]:
a*b

array([ 10.,  40.,  90., 160.])

In [317]:
b**2

array([ 1,  4,  9, 16])

In [319]:
a>15

array([False,  True,  True,  True])

In [320]:
np.log(b)

array([0.        , 0.69314718, 1.09861229, 1.38629436])

In [321]:
np.tan(a)

array([ 0.64836083,  2.23716094, -6.4053312 , -1.11721493])

In [322]:
np.tanh(a)

array([1., 1., 1., 1.])

In [325]:
a = np.random.randint(0,5,(3,4))

In [328]:
b = np.random.randint(0,5,(4,2))

In [329]:
a@b

array([[23,  6],
       [39, 16],
       [15,  2]])

In [ ]:
#a*b

In [331]:
np.dot(a,b)

array([[23,  6],
       [39, 16],
       [15,  2]])

In [333]:
a = np.arange(0,24)

In [334]:
a

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23])

In [336]:
a = a.reshape(6,4)

In [337]:
a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [338]:
np.sqrt(a)

array([[0.        , 1.        , 1.41421356, 1.73205081],
       [2.        , 2.23606798, 2.44948974, 2.64575131],
       [2.82842712, 3.        , 3.16227766, 3.31662479],
       [3.46410162, 3.60555128, 3.74165739, 3.87298335],
       [4.        , 4.12310563, 4.24264069, 4.35889894],
       [4.47213595, 4.58257569, 4.69041576, 4.79583152]])

In [346]:
np.sum(a, axis=1)

array([ 6, 22, 38, 54, 70, 86])

In [348]:
np.min(a, axis=1)

array([ 0,  4,  8, 12, 16, 20])

In [341]:
np.max(a)

23

In [350]:
np.mean(a, axis=1)

array([ 1.5,  5.5,  9.5, 13.5, 17.5, 21.5])

In [352]:
np.std(a, axis=1)

array([1.11803399, 1.11803399, 1.11803399, 1.11803399, 1.11803399,
       1.11803399])

In [344]:
a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [353]:
a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [354]:
a.flatten()

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23])

In [355]:
a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [357]:
a.reshape(3,8)

array([[ 0,  1,  2,  3,  4,  5,  6,  7],
       [ 8,  9, 10, 11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20, 21, 22, 23]])

In [358]:
a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [359]:
a.T

array([[ 0,  4,  8, 12, 16, 20],
       [ 1,  5,  9, 13, 17, 21],
       [ 2,  6, 10, 14, 18, 22],
       [ 3,  7, 11, 15, 19, 23]])

In [360]:
a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [361]:
np.transpose(a)

array([[ 0,  4,  8, 12, 16, 20],
       [ 1,  5,  9, 13, 17, 21],
       [ 2,  6, 10, 14, 18, 22],
       [ 3,  7, 11, 15, 19, 23]])

In [364]:
a = np.random.randint(0,10,(2,2))

In [367]:
b = np.random.randint(0,10, (2,2))

In [368]:
a

array([[5, 7],
       [1, 1]])

In [369]:
b

array([[1, 6],
       [4, 9]])

In [371]:
np.vstack((a,b))

array([[5, 7],
       [1, 1],
       [1, 6],
       [4, 9]])

In [372]:
np.hstack((a,b))

array([[5, 7, 1, 6],
       [1, 1, 4, 9]])

In [375]:
a = np.random.randint(0,10,(3,3))

In [380]:
b = np.array([[1,2,3]])

In [381]:
a

array([[6, 9, 7],
       [0, 8, 8],
       [2, 3, 6]])

In [382]:
b

array([[1, 2, 3]])

In [383]:
a.shape

(3, 3)

In [384]:
b.shape

(1, 3)

In [385]:
a+b

array([[ 7, 11, 10],
       [ 1, 10, 11],
       [ 3,  5,  9]])

In [388]:
a + b.T

array([[ 7, 10,  8],
       [ 2, 10, 10],
       [ 5,  6,  9]])

In [389]:
 a

array([[6, 9, 7],
       [0, 8, 8],
       [2, 3, 6]])

In [390]:
a+4

array([[10, 13, 11],
       [ 4, 12, 12],
       [ 6,  7, 10]])

In [392]:
p1 = np.array([1,2,4,7,-2,9,6,0])

In [396]:
p2 =  np.array([5,5,8,2,-9,2,1,6])

In [397]:
s = 0
for i in range(8):
    s+=(p2[i]-p1[i])**2

In [398]:
s

225

In [399]:
np.sqrt(s)

15.0

In [400]:
s**0.5

15.0

In [411]:
def distance(p1,p2):
    return np.sqrt(np.sum((p2-p1)**2))

In [412]:
distance(p1,p2)

15.0